[
    {
        "title": "Accountancy",
        "url": "accountancy",
        "article": "<h3 class='text-danger' >CBSE Class 12 Accountancy Previous Year Question Papers PDF</h3>  <p>The CBSE Class 12 Accountancy Board exam is conducted in offline mode where students are required to write the answers with pen on paper. Also, the students are provided printable Accountancy question papers that are sealed till the exam begins. But, for the convenience of board candidates here we have given the CBSE Class 12 Accountancy Previous Year Question Papers PDF. </p>"
    },
    {
        "title": "Biology",
        "url": "biology",
        "article": "<h3 class='text-danger' >CBSE Class 12 Biology Previous Year Question Paper</h3> <p>To understand the types of questions asked from class 12 Biology each year, students can refer to the CBSE Class 12 Biology Previous Year Question Paper. The Previous Year Question papers contain real questions of Biology which were asked in the past years during the Class 12 Board examination. </p>"
    },
    {
        "title": "Biotechnology",
        "url": "biotechnology",
        "article": "<h3 class='text-danger' >CBSE Class 12 Biotechnology Previous Year Question Papers PDF</h3> <p>The CBSE Class 12 Biotechnology Board exam is conducted in offline mode where students are required to write the answers with pen on paper. Also, the students are provided printable Biotechnology question papers that are sealed till the exam begins. But, for the convenience of board candidates here we have given the CBSE Class 12 Biotechnology Previous Year Question Papers PDF.&nbsp;</p>"
    },
    {
        "title": "Business Studies",
        "url": "business-studies",
        "article": "<h3 class='text-danger' >CBSE Class 12 Business Studies Previous Year Question Paper</h3> <p>To understand the types of questions asked from class 12 Business Studies each year, students can refer to the CBSE Class 12 Business Studies Previous Year Question Paper. The Previous Year Question papers contain real questions of Business Studies which were asked in the past years during the Class 12 Board examination. </p>"
    },
    {
        "title": "Chemistry",
        "url": "chemistry",
        "article": "<h3 class='text-danger' >CBSE Class 12 Chemistry Previous Year Question Papers PDF</h3> <p>The CBSE Class 12 Chemistry Board exam is conducted in offline mode where students are required to write the answers with pen on paper. Also, the students are provided printable Chemistry question papers that are sealed till the exam begins. But, for the convenience of board candidates here we have given the CBSE Class 12 Chemistry Previous Year Question Papers PDF.&nbsp;</p>"
    },
    {
        "title": "Computer Science (Cpp)",
        "url": "computer-science-cpp",
        "article": "<h3 class='text-danger' >CBSE Class 12 Computer Science (C++) Previous Year Question Papers PDF</h3> <p>The CBSE Class 12 Computer Science (C++) Board exam is conducted in offline mode where students are required to write the answers with pen on paper. Also, the students are provided printable Computer Science (C++) question papers that are sealed till the exam begins. But, for the convenience of board candidates here we have given the CBSE Class 12 Computer Science (C++) Previous Year Question Papers PDF.&nbsp;</p>"
    },
    {
        "title": "Economics",
        "url": "economics",
        "article": "<h3 class='text-danger' >CBSE Class 12 Economics Previous Year Question Papers PDF</h3><p>The CBSE Class 12 Economics Board exam is conducted in offline mode where students are required to write the answers with pen on paper. Also, the students are provided printable Economics question papers that are sealed till the exam begins. But, for the convenience of board candidates here we have given the CBSE Class 12 Economics Previous Year Question Papers PDF.&nbsp;</p>"
    },
    {
        "title": "Engineering Graphics",
        "url": "engineering-graphics",
        "article": "<h3 class='text-danger' >CBSE Class 12 Engineering Graphics Previous Year Question Papers PDF</h3> <p>The CBSE Class 12 Engineering Graphics Board exam is conducted in offline mode where students are required to write the answers with pen on paper. Also, the students are provided printable Engineering Graphics question papers that are sealed till the exam begins. But, for the convenience of board candidates here we have given the CBSE Class 12 Engineering Graphics Previous Year Question Papers PDF.&nbsp;</p>"
    },
    {
        "title": "English",
        "url": "english",
        "article": "<h3 class='text-danger' >CBSE Class 12 English Previous Year Question Papers PDF</h3> <p>The CBSE Class 12 English Board exam is conducted in offline mode where students are required to write the answers with pen on paper. Also, the students are provided printable English question papers that are sealed till the exam begins. But, for the convenience of board candidates here we have given the CBSE Class 12 English Previous Year Question Papers PDF.&nbsp;</p>"
    },
    {
        "title": "Entrepreneurship",
        "url": "entrepreneurship",
        "article": "<h3 class='text-danger' >CBSE Class 12 Entrepreneurship Previous Year Question Papers PDF</h3> <p>The CBSE Class 12 Entrepreneurship Board exam is conducted in offline mode where students are required to write the answers with pen on paper. Also, the students are provided printable Entrepreneurship question papers that are sealed till the exam begins. But, for the convenience of board candidates here we have given the CBSE Class 12 Entrepreneurship Previous Year Question Papers PDF.&nbsp;</p>"
    },
    {
        "title": "Geography",
        "url": "geography",
        "article": "<h3 class='text-danger' >CBSE Class 12 Geography Previous Year Question Papers PDF</h3> <p>The CBSE Class 12 Geography Board exam is conducted in offline mode where students are required to write the answers with pen on paper. Also, the students are provided printable Geography question papers that are sealed till the exam begins. But, for the convenience of board candidates here we have given the CBSE Class 12 Geography Previous Year Question Papers PDF.&nbsp;</p>"
    },
    {
        "title": "Hindi Core",
        "url": "hindi-core",
        "article": "<h3 class='text-danger' >CBSE Class 12 Hindi Core Previous Year Question Papers PDF</h3> <p>The CBSE Class 12 Hindi Core Board exam is conducted in offline mode where students are required to write the answers with pen on paper. Also, the students are provided printable Hindi Core question papers that are sealed till the exam begins. But, for the convenience of board candidates here we have given the CBSE Class 12 Hindi Core Previous Year Question Papers PDF.&nbsp;</p>"
    },
    {
        "title": "Hindi Elective",
        "url": "hindi-elective",
        "article": "<h3 class='text-danger' >CBSE Class 12 Hindi Elective Previous Year Question Papers PDF</h3><p>The CBSE Class 12 Hindi Elective Board exam is conducted in offline mode where students are required to write the answers with pen on paper. Also, the students are provided printable Hindi Elective question papers that are sealed till the exam begins. But, for the convenience of board candidates here we have given the CBSE Class 12 Hindi Elective Previous Year Question Papers PDF.&nbsp;</p>"
    },
    {
        "title": "History",
        "url": "history",
        "article": "<h3 class='text-danger' >CBSE Class 12 History Previous Year Question Papers PDF</h3><p>The CBSE Class 12 History Board exam is conducted in offline mode where students are required to write the answers with pen on paper. Also, the students are provided printable History question papers that are sealed till the exam begins. But, for the convenience of board candidates here we have given the CBSE Class 12 History Previous Year Question Papers PDF.&nbsp;</p>"
    },
    {
        "title": "Home Science",
        "url": "home-science",
        "article": "<h3 class='text-danger' >CBSE Class 12 Home Science Previous Year Question Papers PDF</h3> <p>The CBSE Class 12 Home Science Board exam is conducted in offline mode where students are required to write the answers with pen on paper. Also, the students are provided printable Home Science question papers that are sealed till the exam begins. But, for the convenience of board candidates here we have given the CBSE Class 12 Home Science Previous Year Question Papers PDF.&nbsp;</p>"
    },
    {
        "title": "Informatics Practice",
        "url": "informatics-practice",
        "article": "<h3 class='text-danger' >CBSE Class 12 Informatics Practices Previous Year Question Papers PDF</h3> <p>The CBSE Class 12 Informatics Practices Board exam is conducted in offline mode where students are required to write the answers with pen on paper. Also, the students are provided printable Informatics Practices question papers that are sealed till the exam begins. But, for the convenience of board candidates here we have given the CBSE Class 12 Informatics Practices Previous Year Question Papers PDF.&nbsp;</p>"
    },
    {
        "title": "Legal Studies",
        "url": "legal-studies",
        "article": "<h3 class='text-danger' >CBSE Class 12 Legal Studies Previous Year Question Papers PDF</h3><p>The CBSE Class 12 Legal Studies Board exam is conducted in offline mode where students are required to write the answers with pen on paper. Also, the students are provided printable Legal Studies question papers that are sealed till the exam begins. But, for the convenience of board candidates here we have given the CBSE Class 12 Legal Studies Previous Year Question Papers PDF.&nbsp;</p>"
    },
    {
        "title": "Maths",
        "url": "maths",
        "article": "<h3 class='text-danger' >CBSE Class 12 Maths Previous Year Question Papers PDF</h3> <p>The CBSE Class 12 Maths Board exam is conducted in offline mode where students are required to write the answers with pen on paper. Also, the students are provided printable Maths question papers that are sealed till the exam begins. But, for the convenience of board candidates here we have given the CBSE Class 12 Maths Previous Year Question Papers PDF.&nbsp;</p>"
    },
    {
        "title": "Physical Education",
        "url": "physical-education",
        "article": "<h3 class='text-danger' >CBSE Class 12 Physical Education Previous Year Question Papers PDF</h3> <p>The CBSE Class 12 Physical Education Board exam is conducted in offline mode where students are required to write the answers with pen on paper. Also, the students are provided printable Physical Education question papers that are sealed till the exam begins. But, for the convenience of board candidates here we have given the CBSE Class 12 Physical Education Previous Year Question Papers PDF.&nbsp;</p>"
    },
    {
        "title": "Physics",
        "url": "physics",
        "article": "<h3 class='text-danger' >CBSE Class 12 Physics Previous Year Question Papers PDF</h3> <p>The CBSE Class 12 Physics Board exam is conducted in offline mode where students are required to write the answers with pen on paper. Also, the students are provided printable Physics question papers that are sealed till the exam begins. But, for the convenience of board candidates here we have given the CBSE Class 12 Physics Previous Year Question Papers PDF.&nbsp;</p>"
    },
    {
        "title": "Political Science",
        "url": "political-science",
        "article": "<h3 class='text-danger' >CBSE Class 12 Political Science Previous Year Question Papers PDF</h3><p>The CBSE Class 12 Political Science Board exam is conducted in offline mode where students are required to write the answers with pen on paper. Also, the students are provided printable Political Science question papers that are sealed till the exam begins. But, for the convenience of board candidates here we have given the CBSE Class 12 Political Science Previous Year Question Papers PDF.&nbsp;</p>"
    },
    {
        "title": "Psychology",
        "url": "psychology",
        "article": "<h3 class='text-danger' >CBSE Class 12 Psychology Previous Year Question Papers PDF</h3> <p>The CBSE Class 12 Psychology Board exam is conducted in offline mode where students are required to write the answers with pen on paper. Also, the students are provided printable Psychology question papers that are sealed till the exam begins. But, for the convenience of board candidates here we have given the CBSE Class 12 Psychology Previous Year Question Papers PDF.&nbsp;</p>"
    },
    {
        "title": "Sociology",
        "url": "sociology",
        "article": "<h3 class='text-danger' >CBSE Class 12 Sociology Previous Year Question Papers PDF</h3><p>The CBSE Class 12 Sociology Board exam is conducted in offline mode where students are required to write the answers with pen on paper. Also, the students are provided printable Sociology question papers that are sealed till the exam begins. But, for the convenience of board candidates here we have given the CBSE Class 12 Sociology Previous Year Question Papers PDF.&nbsp;</p>"
    }
]