[
    {
        "title": "English",
        "url": "english",
        "article": "<h3 class=\"text-danger\">CBSE Class 10 English Previous Year Question Papers PDF</h3>\r\n<p>Students who are preparing for class 10 English, need to score good marks in the exam. For scoring good marks, students need to practise a lot of questions from CBSE previous year question papers class 10 English. Practising questions can help students to have a deep knowledge about all kinds of questions. Previous year question paper class 10 English CBSE also gives the knowledge about the exam pattern and marking scheme of class 10 English. </p>\r\n<p>CBSE previous year question papers class 10 English can also give the knowledge about the weightage of each chapter. Students generally cover all the concepts in the chapter according to the given weightage. Studying according to the weightage can help students to score well in class 10 English board exam. </p>"
    },
    {
        "title": "Hindi",
        "url": "hindi",
        "article": "\r\n\r\n<h3 class=\"text-danger\">CBSE Class 10 Hindi Previous Year Question Papers PDF</h3>\r\n <p>Students who are preparing for class 10 Hindi, need to score good marks in the exam. For scoring good marks, students need to practise a lot of questions from CBSE previous year question papers class 10 Hindi. Practising questions can help students to have a deep knowledge about all kinds of questions. Previous year question paper class 10 Hindi CBSE also gives the knowledge about the exam pattern and marking scheme of class 10 Hindi. </p>\r\n\r\n<p>CBSE previous year question papers class 10 Hindi can also give the knowledge about the weightage of each chapter. Students generally cover all the concepts in the chapter according to the given weightage. Studying according to the weightage can help students to score well in class 10 Hindi board exam. </p>"
    },
    {
        "title": "Maths",
        "url": "maths",
        "article": "\r\n<h3 class=\"text-danger\">CBSE Class 10 Math Previous Year Question Papers PDF</h3>\r\n  <p>Students who are preparing for class 10 Maths, need to score good marks in the exam. For scoring good marks, students need to practise a lot of questions from CBSE previous year question papers class 10 Maths. Practising questions can help students to have a deep knowledge about all kinds of questions. Previous year question paper class 10 Maths CBSE also gives the knowledge about the exam pattern and marking scheme of class 10 Maths. </p>\r\n\r\n<p>CBSE previous year question papers class 10 Maths can also give the knowledge about the weightage of each chapter. Students generally cover all the concepts in the chapter according to the given weightage. Studying according to the weightage can help students to score well in class 10 Maths board exam. </p>"
    },
    {
        "title": "Science",
        "url": "science",
        "article": "<h3 class=\"text-danger\">CBSE Class 10 Science Previous Year Question Papers PDF</h3>\r\n <p>Students who are preparing for class 10 Science, need to score good marks in the exam. For scoring good marks, students need to practise a lot of questions from CBSE previous year question papers class 10 Science. Practising questions can help students to have a deep knowledge about all kinds of questions. Previous year question paper class 10 Science CBSE also gives the knowledge about the exam pattern and marking scheme of class 10 Science. </p>\r\n\r\n<p>CBSE previous year question papers class 10 Science can also give the knowledge about the weightage of each chapter. Students generally cover all the concepts in the chapter according to the given weightage. Studying according to the weightage can help students to score well in class 10 Science board exam. </p>"
    },
    {
        "title": "Social Science",
        "url": "social-science",
        "article": "<h3 class=\"text-danger\">CBSE Class 10 Social Science Previous Year Question Papers PDF</h3>\r\n<p>Students who are preparing for class 10 Social Science, need to score good marks in the exam. For scoring good marks, students need to practise a lot of questions from CBSE previous year question papers class 10 Social Science. Practising questions can help students to have a deep knowledge about all kinds of questions. Previous year question paper class 10 Social Science CBSE also gives the knowledge about the exam pattern and marking scheme of class 10 Social Science. </p>\r\n\r\n<p>CBSE previous year question papers class 10 Social Science can also give the knowledge about the weightage of each chapter. Students generally cover all the concepts in the chapter according to the given weightage. Studying according to the weightage can help students to score well in class 10 Social Science board exam. </p>"
    },
    {
        "title": "Computer Applications",
        "url": "computer-applications",
        "article": "<h3 class=\"text-danger\">CBSE Class 10 Computer Applications Previous Year Question Papers PDF</h3>\r\n   <p>Students who are preparing for class 10 Computer Applications, need to score good marks in the exam. For scoring good marks, students need to practise a lot of questions from CBSE previous year question papers class 10 Computer Applications. Practising questions can help students to have a deep knowledge about all kinds of questions. Previous year question paper class 10 Computer Applications CBSE also gives the knowledge about the exam pattern and marking scheme of class 10 Computer Applications. </p>\r\n\r\n<p>CBSE previous year question papers class 10 Computer Applications can also give the knowledge about the weightage of each chapter. Students generally cover all the concepts in the chapter according to the given weightage. Studying according to the weightage can help students to score well in class 10 Computer Applications board exam. </p>"
    }
]